{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,300,1],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"conv1d_Conv1D4","class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D4","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"max_pooling1d_MaxPooling1D3","class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D3","trainable":true},"inbound_nodes":[[["conv1d_Conv1D4",0,0,{}]]]},{"name":"conv1d_Conv1D5","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D5","trainable":true},"inbound_nodes":[[["max_pooling1d_MaxPooling1D3",0,0,{}]]]},{"name":"max_pooling1d_MaxPooling1D4","class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D4","trainable":true},"inbound_nodes":[[["conv1d_Conv1D5",0,0,{}]]]},{"name":"conv1d_Conv1D6","class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D6","trainable":true},"inbound_nodes":[[["max_pooling1d_MaxPooling1D4",0,0,{}]]]},{"name":"lstm_LSTM3","class_name":"LSTM","config":{"name":"lstm_LSTM3","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.2,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["conv1d_Conv1D6",0,0,{}]]]},{"name":"lstm_LSTM4","class_name":"LSTM","config":{"name":"lstm_LSTM4","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.2,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["lstm_LSTM3",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["lstm_LSTM4",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":2,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["dense_Dense4",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1d_Conv1D4/kernel","shape":[5,1,64],"dtype":"float32"},{"name":"conv1d_Conv1D4/bias","shape":[64],"dtype":"float32"},{"name":"conv1d_Conv1D5/kernel","shape":[5,64,128],"dtype":"float32"},{"name":"conv1d_Conv1D5/bias","shape":[128],"dtype":"float32"},{"name":"conv1d_Conv1D6/kernel","shape":[3,128,128],"dtype":"float32"},{"name":"conv1d_Conv1D6/bias","shape":[128],"dtype":"float32"},{"name":"lstm_LSTM3/kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_LSTM3/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_LSTM3/bias","shape":[512],"dtype":"float32"},{"name":"lstm_LSTM4/kernel","shape":[128,256],"dtype":"float32"},{"name":"lstm_LSTM4/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM4/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[64,2],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[2],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}