{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,30],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[1,30,1],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv1","class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[10,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"conv2","class_name":"Conv2D","config":{"filters":30,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2","trainable":true},"inbound_nodes":[[["conv1",0,0,{}]]]},{"name":"conv3","class_name":"Conv2D","config":{"filters":40,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[6,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv3","trainable":true},"inbound_nodes":[[["conv2",0,0,{}]]]},{"name":"conv4","class_name":"Conv2D","config":{"filters":50,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv4","trainable":true},"inbound_nodes":[[["conv3",0,0,{}]]]},{"name":"conv5","class_name":"Conv2D","config":{"filters":50,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv5","trainable":true},"inbound_nodes":[[["conv4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["conv5",0,0,{}]]]},{"name":"dense1","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"power_output","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"power_output","trainable":true},"inbound_nodes":[[["dense1",0,0,{}]]]},{"name":"onoff_output","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"onoff_output","trainable":true},"inbound_nodes":[[["dense1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["power_output",0,0],["onoff_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1/kernel","shape":[10,1,1,30],"dtype":"float32"},{"name":"conv1/bias","shape":[30],"dtype":"float32"},{"name":"conv2/kernel","shape":[8,1,30,30],"dtype":"float32"},{"name":"conv2/bias","shape":[30],"dtype":"float32"},{"name":"conv3/kernel","shape":[6,1,30,40],"dtype":"float32"},{"name":"conv3/bias","shape":[40],"dtype":"float32"},{"name":"conv4/kernel","shape":[5,1,40,50],"dtype":"float32"},{"name":"conv4/bias","shape":[50],"dtype":"float32"},{"name":"conv5/kernel","shape":[5,1,50,50],"dtype":"float32"},{"name":"conv5/bias","shape":[50],"dtype":"float32"},{"name":"dense1/kernel","shape":[1500,1024],"dtype":"float32"},{"name":"dense1/bias","shape":[1024],"dtype":"float32"},{"name":"power_output/kernel","shape":[1024,1],"dtype":"float32"},{"name":"power_output/bias","shape":[1],"dtype":"float32"},{"name":"onoff_output/kernel","shape":[1024,1],"dtype":"float32"},{"name":"onoff_output/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}