{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,599],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[599,1],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"conv1_p","class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[13],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1_p","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}]]]},{"name":"conv1_s","class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[13],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1_s","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}]]]},{"name":"conv2_p","class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[11],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2_p","trainable":true},"inbound_nodes":[[["conv1_p",0,0,{}]]]},{"name":"conv2_s","class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[11],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2_s","trainable":true},"inbound_nodes":[[["conv1_s",0,0,{}]]]},{"name":"conv3_p","class_name":"Conv1D","config":{"filters":20,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[9],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv3_p","trainable":true},"inbound_nodes":[[["conv2_p",0,0,{}]]]},{"name":"conv3_s","class_name":"Conv1D","config":{"filters":20,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[9],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv3_s","trainable":true},"inbound_nodes":[[["conv2_s",0,0,{}]]]},{"name":"conv4_p","class_name":"Conv1D","config":{"filters":25,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv4_p","trainable":true},"inbound_nodes":[[["conv3_p",0,0,{}]]]},{"name":"conv4_s","class_name":"Conv1D","config":{"filters":25,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv4_s","trainable":true},"inbound_nodes":[[["conv3_s",0,0,{}]]]},{"name":"conv5_p","class_name":"Conv1D","config":{"filters":25,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv5_p","trainable":true},"inbound_nodes":[[["conv4_p",0,0,{}]]]},{"name":"conv5_s","class_name":"Conv1D","config":{"filters":25,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv5_s","trainable":true},"inbound_nodes":[[["conv4_s",0,0,{}]]]},{"name":"flatten_Flatten3","class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true},"inbound_nodes":[[["conv5_p",0,0,{}]]]},{"name":"flatten_Flatten4","class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true},"inbound_nodes":[[["conv5_s",0,0,{}]]]},{"name":"fc1_p","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"fc1_p","trainable":true},"inbound_nodes":[[["flatten_Flatten3",0,0,{}]]]},{"name":"fc1_s","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"fc1_s","trainable":true},"inbound_nodes":[[["flatten_Flatten4",0,0,{}]]]},{"name":"power_output","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"power_output","trainable":true},"inbound_nodes":[[["fc1_p",0,0,{}]]]},{"name":"onoff_output","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"onoff_output","trainable":true},"inbound_nodes":[[["fc1_s",0,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["power_output",0,0],["onoff_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1_p/kernel","shape":[13,1,16],"dtype":"float32"},{"name":"conv1_p/bias","shape":[16],"dtype":"float32"},{"name":"conv1_s/kernel","shape":[13,1,16],"dtype":"float32"},{"name":"conv1_s/bias","shape":[16],"dtype":"float32"},{"name":"conv2_p/kernel","shape":[11,16,16],"dtype":"float32"},{"name":"conv2_p/bias","shape":[16],"dtype":"float32"},{"name":"conv2_s/kernel","shape":[11,16,16],"dtype":"float32"},{"name":"conv2_s/bias","shape":[16],"dtype":"float32"},{"name":"conv3_p/kernel","shape":[9,16,20],"dtype":"float32"},{"name":"conv3_p/bias","shape":[20],"dtype":"float32"},{"name":"conv3_s/kernel","shape":[9,16,20],"dtype":"float32"},{"name":"conv3_s/bias","shape":[20],"dtype":"float32"},{"name":"conv4_p/kernel","shape":[7,20,25],"dtype":"float32"},{"name":"conv4_p/bias","shape":[25],"dtype":"float32"},{"name":"conv4_s/kernel","shape":[7,20,25],"dtype":"float32"},{"name":"conv4_s/bias","shape":[25],"dtype":"float32"},{"name":"conv5_p/kernel","shape":[5,25,25],"dtype":"float32"},{"name":"conv5_p/bias","shape":[25],"dtype":"float32"},{"name":"conv5_s/kernel","shape":[5,25,25],"dtype":"float32"},{"name":"conv5_s/bias","shape":[25],"dtype":"float32"},{"name":"fc1_p/kernel","shape":[14975,512],"dtype":"float32"},{"name":"fc1_p/bias","shape":[512],"dtype":"float32"},{"name":"fc1_s/kernel","shape":[14975,512],"dtype":"float32"},{"name":"fc1_s/bias","shape":[512],"dtype":"float32"},{"name":"power_output/kernel","shape":[512,1],"dtype":"float32"},{"name":"power_output/bias","shape":[1],"dtype":"float32"},{"name":"onoff_output/kernel","shape":[512,1],"dtype":"float32"},{"name":"onoff_output/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}